# Задание 1
phrase = "Programming is fun!"
print("Первый символ строки:", phrase[0])
print("Пятый символ с конца строки:", phrase[-5])
print("Последний символ строки:", phrase[-1])

# Задание 2
numbers = [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
print("Третий элемент списка:", numbers[2])
print("Последний элемент списка:", numbers[-1])
print("Шестой элемент с конца списка:", numbers[-6])

# Задание 4
quote = "The quick brown fox jumps over the lazy dog"
print("Первые пять символов строки:", quote[:5])
print("Подстрока с 10-го по 19-й символ:", quote[9:19])
print("Каждый второй символ строки:", quote[::2])
print("Развернутая строка:", quote[::-1])

# Задание 5
numbers = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
print("Первые четыре элемента списка:", numbers[:4])
print("Подсписок с 5-го по 8-й элемент:", numbers[4:8])
print("Все чётные элементы списка, начиная с первого:", numbers[::2])
print("Развернутый список:", numbers[::-1])
