#Задание 1
age1 = int(input("Введите ваш возраст"))
age2 = int(input("Ввидите возраст друга"))
age3 = age1+age2
print ("Сумма возрастов", age3)

#Задание 2
name = input("Введите имя")
name2 = input("Введите фамилию")
print(f"Привет, {name}, {name2}")

#Задание 3
print("1.Суп\n2.Паста\n3.Десерт")

#Задание 4
print("***\n***\n***")

#Задание 5
x = int(input("Введите число"))
x1 = x
a = x-3
b = x-2
c = x-1
a1 = x+3
b1 = x+2
c1 = x+1
print(f"{a} {b} {c}\n{x1}\n{a1} {b1} {c1}")