#Задание 1
age1 = int(input("Введите ваш возраст: "))
age2 = int(input("Введите возраст друга: "))
print("Сумма возрастов:", age1 + age2)

#Задание 2
first_name = input("Введите имя: ")
last_name = input("Введите фамилию: ")
print(f"Привет, {first_name} {last_name}!")

#Задание 3
print("1.Суп\n2.Паста\n3.Десерт")

#Задание 4
print("***\n***\n***")

#Задание 5
x = int(input("Введите число: "))
print(f"{x-3} {x-2} {x-1}\n{x}\n{x+3} {x+2} {x+1}")
